num = 5
# data type

print(type(num)) #type ფუნქციის საშვალებით ვიგებთ ცვლადის ტიპს

#საკლასო სამუშაო
#1 შქმენით სამი განსხვავებული ცვლადი რომლის მნიშვნელობებიც იქნება განსხვავებული მონაცემთა ტიპები შემდეგ კი დაბეჭდეთ თითოეული ცვლადი და მათი მონაცემთა ტიპები

fruite = "apple"
num1 = 30
num2 = 4,5

print(type(fruite))
print(type(num1))
print(type(num2))


num3 = "20"
num4 = 20

number = int(num3)
number2 =str(num4)


print(type(number))
print(type(number2))


#2 შექმენიც 3 ცვლადი პირველის თავდაპირველის მონაცემთა ტიპი იქნება სტრინგი მეორის ინტეჯერი ხოლომესამის ფლოატ შემდეგ გარდაქმენით სტრინგი ინტეჯერში , ინტეჯერი ფლოათში, ხოლო ფლოათი სტრინგში,დაბეჭდეთ თითოეული მათგანი და გარდაქმნილი მნიშვნელობების მონაცემთა ტიტები.

num7 = "9"
num8 = 9
num9 = 9.9

number7 = int(num7)
number8 =float(num8)
number9 =str(num9)

print(type(number7))
print(type(number8))
print(type(number9))
#strს str უნდა დაემატოს ხოლო  intს intი უნდა დაემატოს
print(str(num8) + num7)
print(num8 + int(num7))
print("score " + str(num8 + int(num7)))




#3 შექმენით ცვლადი რომელშიც შეინახავთ თქვენს სახელს შემდეგ შექმენით მეორე ცვლადი სადაც შეინახავთ თქვენს გვარს, შექმენით მესამე ცვლადი სადაც შენახული იქნება თქვენი წელი ოღონდ ინტეჯერის სახით, შემდეგ დაბეჭდეთ ეს ყველა ინფორმაცია ერთ გრძელ წინადადებაში ისე რომ გადააქციოთ ელემენტები საჭირო მონაცემთა ტიპებში

name = "gvanca"
surname = "kopadze"
age = 16
print(name + " " + surname + " " + str(age))
