#4) კომენტარებით ახსენით თუ როგორ ვქმნით ცვლადს და რა არის მისი დანიშნულება

#ცვლადების საშვალებით ვარქმევთ სახელს, ვინახავთ მონაცემებს და ვაკეთებთ მათემატიკურ მოქმედებებს.
#მაგალითად:
num1 = 3
num2 = 7
print(num1 + num2)

#არსებობს ხცვადასხვა ტიპის ცვლადები:
##1) string-str  ავღნიშნავთ ბრჭყალებში მოცემულ ტექსტს და ვიყენებთ ტექსტებთან მუშაობის დროს
#2) intejer-int ავღნიშნავთ მთელ რიცხვებს და ვიყენებთ მთელ რიცხვებთან მუშაობის დროს
#3) float-float ავღნიშნავთ ათწილადებს და ვიყენებთ ათწილადებთან მშაობის დროს
#4) boolean_bool ავღნიშნავთ ჭეშმარიტს და მცდარს (true or false)
