# comparison operations - შედარების ოპერატორები(ოპერაციები)

#5 < 10  რიცხვების შედარებები(< , >)
#კომპიუტერს შეუძლია ბულიან ტიპის ცვლადით დაადგინოს ეს შედარებები ჭეშმარიტია თუ მცდარი (true and false)
#მაგალითად:
print(5 < 10)
print(3 < 1)



#data types-str,int,float,bool
#boolean-bool

True
False


print(type(True))
print(type(False))



# > - მეტონის ნიშანი / ოპერატორი
# < – ნაკლებობის ნიშანი / ოპერატორი
# = მიმნიჭებელი ოპერატორი
# == შედარების ოპერატორი
# <= მეტია ან ტოლი
# >= ნაკლებია ან ტოლი

num = 5

print(5 == 7)

print("5 == 7" + str(5 == 7))




print(5 >= 5) # მეტია ან ტოლია 




#logical operations - ლოგიკური ოპერაციები
#and – და
#or - ან

10 > 5 and 3 > 1  # მივიღებთ ლოგიკურ წინადადებას True and True

