#class work
#1) შეადარეთ ორი რიცხვი ერთმანეთს ყველა შესაძლო შედარების ოპერატორის გამოყენებით, ახსენით კომენტარის სახით თქვენი სიტყვებით რა არის boolean ი და რაში გვჭირდება შედარების ოპერატორები


print(3 < 1)
print(3 == 3)
print(3 > 1)
print(3 >= 1)
print(3 <= 3)


# >  მეტონის ნიშანი / ოპერატორი
# <  ნაკლებობის ნიშანი / ოპერატორი
# = მიმნიჭებელი ოპერატორი
# == შედარების ოპერატორი
# <= მეტია ან ტოლი
# >= ნაკლებია ან ტოლი


# data type - boolean(bool)
#ბულიანი ტიპის ცვლადი ადგენს ჭეშმარიტია თუ მცდარი შედარებითი ოპერაციები