#1) დაადეკლარირეთ(შექმენით) 3 ინტეჯერ ტიპის ცვლადი სადაც შეინახავთ მთელ რიცხვებს და დაბეჭდავთ(print) მათ ჯამს
num1 = 10
num2 = 34
num3 = 98
print(num1 + num2 + num3)

#2) დაადეკლარირეთ სტრინგ ტიპის ცვლადი სახელად name რომელსაც მიანიჭებთ მნიშვნელობად თქვენს სახელს
name = "Gvanca"

#3) დაადეკლარირეთ float ტიპის ცვლადი სახელად height რომელსაც მიანიჭებთ მნიშვმელობად თქვენს სიმაღლეს
height = 165.5

#4) დაადეკლარირეთ ინტეჯერ ტიპის ცვლადი სახელად x რომელსაც თავდაპირველი მნიშვნელობა იქნება 15 შემდეგ მიუმატეთ 5 და ისე დაბეჭდეთ ცვლადი

x = 15
print(x + 5)

#5) მოახდინეთ კონკატენაცია ორი სტრინგ ტიპის ცვლადის ერთში იყოს თქვემი სახელი მეორეში გვარი
name = "gvanca"
surname = "kopadze"
#კონკატერაცია არის სტრინგების შეერთება
print(name + surname)
#ან
print("gvanca" + "kopadze")

#6) გაამრავლეთ  5-ზე price ცვლადი რომლის მნიშვნელობაც იქნება 100
price = 100
print(price * 5)

